In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
# MacBook
path = os.getcwd()
path

In [ ]:
os.chdir(path + '/data/')
os.getcwd()

In [3]:
# Windows
path = os.getcwd()
path

'C:\\Users\\kiip\\Documents\\github\\doit_pandas'

In [4]:
os.chdir(path + '\\data')
os.getcwd()

'C:\\Users\\kiip\\Documents\\github\\doit_pandas\\data'

In [5]:
df1 = pd.read_csv('concat_1.csv')
df2 = pd.read_csv('concat_2.csv')
df3 = pd.read_csv('concat_3.csv')

In [ ]:
print(df1.head())
print(df2.head())
print(df3.head())

In [ ]:
row_concat = pd.concat([df1, df2, df3])
row_concat

In [ ]:
new = row_concat.iloc[3, ]
new

In [ ]:
new2 = row_concat.iloc[:,3]
type(new2)

In [ ]:
new_row_series = pd.Series(['n1', 'n2', 'n3', 'n4'])
new_row_series

In [ ]:
pd.concat([df1, new_row_series])

In [ ]:
new_row_df = pd.DataFrame([['n1', 'n2', 'n3', 'n4']], columns = ['A', 'B', 'C', 'D'])
new_row_df

In [ ]:
new_row_df2 = pd.DataFrame({'A' : ['n1'],
                            'B' : ['n2'],
                            'C' : ['n3'],
                            'D' : ['n4']})
new_row_df2

In [ ]:
pd.concat([df1, new_row_df2])

In [ ]:
data_dict = {'A':'n1', 'B':'n2',
             'C':'n3', 'D':'n4'}
data_dict

In [ ]:
pd.DataFrame.from_dict(data_dict, orient='index')

In [ ]:
row_concat

In [ ]:
pd.concat([df1,df2,df3], ignore_index=True)

In [ ]:
col_concat = pd.concat([df1, df2, df3], axis=1)
col_concat

In [ ]:
col_concat['new'] = ['n1','n2','n3','n4']
col_concat

In [ ]:
pd.concat([df1,df2,df3], axis=1, ignore_index=True)

In [ ]:
df3

In [ ]:
df3.columns = ['A', 'C', 'F', 'H']
df3

In [ ]:
pd.concat([df1,df3], ignore_index=True)

In [ ]:
pd.concat([df1,df2,df3], ignore_index=False)

In [ ]:
pd.concat([df1,df2,df3], ignore_index=False, join='inner')

In [ ]:
df1.index = [0, 1, 2, 3]
df2.index = [4, 5, 6, 7]
df3.index = [0, 2, 5, 7]

In [ ]:
pd.concat([df1,df2,df3], axis=1)

In [ ]:
pd.concat([df1,df3], axis=1, join = 'inner')

In [ ]:
person = pd.read_csv('survey_person.csv')
site = pd.read_csv('survey_site.csv')
survey = pd.read_csv('survey_survey.csv')
visited = pd.read_csv('survey_visited.csv')

In [ ]:
survey_list = ['survey_person', 'survey_site', 
               'survey_survey', 'survey_visited']
filename_list = []

for idx, filename in enumerate(survey_list):
    filename_list.append(filename + '.csv')

filename_list

In [ ]:
person = pd.read_csv(filename_list[0])
site = pd.read_csv(filename_list[1])
survey = pd.read_csv(filename_list[2])
visited = pd.read_csv(filename_list[3])

In [ ]:
survey_shapes = {'person' : person.shape,
                 'site'   : site.shape,
                 'survey' : survey.shape,
                 'visited': visited.shape}
survey_shapes

In [ ]:
visited_subset = visited.loc[[0, 2, 6], ]
visited_subset

In [ ]:
site

In [ ]:
o2o_merge = site.merge(visited_subset, left_on='name', right_on='site')
o2o_merge

In [ ]:
type(site.loc[0])

In [ ]:
site.loc[0, ].index

In [ ]:
site.loc[0].values

In [ ]:
type(df1.loc[0].index)

In [ ]:
type(df1.values)

In [ ]:
df1.loc[0].values

In [ ]:
df1.index[[0,3]]

In [ ]:
df1.values[[0,3]]

In [ ]:
df1.columns

In [ ]:
sr1 = df1['A']
sr1

In [ ]:
df1.loc[0,:].index

In [ ]:
from numpy import NaN, NAN, nan

In [ ]:
pd.isnull(NaN)

In [ ]:
visited = pd.read_csv('survey_visited.csv')
survey = pd.read_csv('survey_survey.csv')

In [ ]:
vs = visited.merge(survey, left_on='ident', right_on='taken')
vs

In [ ]:
visited[visited['ident']==752]

In [ ]:
visited['ident'].unique()

In [ ]:
gapminder = pd.read_csv('gapminder.tsv', sep='\t')

In [ ]:
gapminder.columns

In [ ]:
life1 = gapminder.groupby('year', as_index=False) \
                 .agg(life_mean = ('lifeExp', 'mean')) \
                 .sort_values('life_mean', ascending = False)

In [ ]:
life1

In [ ]:
life2 = gapminder.groupby('year', as_index=False) \
                 .agg(mean_life = ('lifeExp', 'mean')) \
                 .sort_values('mean_life', ascending=False)

In [ ]:
life2.sort_values(['year','mean_life'])

In [ ]:
life2_sr = life2['year'].sort_values(ascending=False)
life2_sr

In [ ]:
life1.loc[range(2000,2010), :]

In [ ]:
life2_sr[life2_sr > 2000]

In [ ]:
life3 = gapminder.groupby('year')['lifeExp'].mean().sort_values(ascending=False)
life3

In [ ]:
life3[life3.index > 2000]

In [ ]:
life1[life1['year']>2000]

In [ ]:
ebola_raw = pd.read_csv('country_timeseries.csv')

In [ ]:
ebola = ebola_raw.copy()
ebola.head()

In [ ]:
ebola.count()

In [ ]:
ebola.shape[0]

In [ ]:
missing = ebola.shape[0] - ebola.count()
missing

In [ ]:
missing[missing>0]

In [ ]:
np.count_nonzero(ebola.isnull())

In [ ]:
missing.sum()

In [ ]:
ebola['Cases_Guinea'].value_counts(dropna=False)[NaN]

In [ ]:
ebola.head()

In [ ]:
ebola['Day'].value_counts()

In [ ]:
ebola['Day'].count()

In [ ]:
ebola.iloc[0:5, 0:5]

In [ ]:
ebola.fillna(0).iloc[0:5, 0:5]

In [ ]:
df1.isnull()

In [ ]:
df1.notnull()

In [ ]:
ebola.bfill().iloc[:5, :5]

In [ ]:
ebola.interpolate().head()

In [ ]:
ebola['Cases_Liberia']

In [ ]:
ebola.infer_objects(copy=False).interpolate()

In [ ]:
ebola.shape

In [ ]:
ebola_dropna = ebola.dropna()

In [ ]:
ebola_dropna.count()

In [ ]:
ebola_dropna

In [ ]:
ebola['Cases_multiple'] = ebola['Cases_Guinea'] + ebola['Cases_Liberia'] + ebola['Cases_SierraLeone']

In [ ]:
ebola

In [ ]:
ebola['Cases_multiple']

In [ ]:
ebola_subset = ebola.loc[:,  ['Cases_Guinea', 'Cases_Liberia', 'Cases_SierraLeone', 'Cases_multiple']]

In [ ]:
ebola_subset.head()

In [ ]:
ebola['Cases_Guinea'].sum(skipna=True)

In [ ]:
ebola['Cases_Guinea'].sum(skipna=False)

In [6]:
os.getcwd()

'C:\\Users\\kiip\\Documents\\github\\doit_pandas\\data'

In [7]:
pew_raw = pd.read_csv('pew.csv')

In [8]:
pew = pew_raw.copy()
pew.head()

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116

In [9]:
pew.shape

(18, 11)

In [11]:
pew.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   religion            18 non-null     object
 1   <$10k               18 non-null     int64
 2   $10-20k             18 non-null     int64
 3   $20-30k             18 non-null     int64
 4   $30-40k             18 non-null     int64
 5   $40-50k             18 non-null     int64
 6   $50-75k             18 non-null     int64
 7   $75-100k            18 non-null     int64
 8   $100-150k           18 non-null     int64
 9   >150k               18 non-null     int64
 10  Don't know/refused  18 non-null     int64
dtypes: int64(10), object(1)
memory usage: 1.7+ KB

In [13]:
pew.describe(include='all')

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
count,18,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000
unique,18,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,Agnostic,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,NaN,107.222222,154.500000,186.500000,183.444444,171.388889,288.055556,221.666667,177.611111,144.888889,340.055556
std,NaN,168.931784,255.172433,309.891869,291.470354,271.144446,458.442436,345.078849,275.679724,205.224952,530.523878
min,NaN,1.000000,2.000000,3.000000,4.000000,2.000000,7.000000,3.000000,4.000000,4.000000,8.000000
25%,NaN,12.250000,14.750000,17.000000,15.750000,15.000000,34.250000,25.250000,22.500000,23.750000,41.250000
50%,NaN,20.000000,27.000000,33.500000,40.000000,34.000000,66.500000,65.500000,48.500000,53.500000,74.500000
75%,NaN,170.000000,193.000000,192.000000,198.750000,166.750000,201.500000,128.750000,103.500000,134.250000,294.750000
max,NaN,575.000000,869.000000,1064.000000,982.000000,881.000000,1486.000000,949.000000,792.000000,634.000000,1529.000000

In [27]:
pew.head(3)

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54

In [33]:
pd.melt(pew, id_vars='religion')

                  religion            variable  value
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [34]:
pew_long = pd.melt(pew, id_vars = 'religion', var_name = 'income', value_name = 'count')
pew_long

                  religion              income  count
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [35]:
bill_raw = pd.read_csv('billboard.csv')

In [37]:
bill = bill_raw.copy()
bill.shape

(317, 81)

In [38]:
bill.head()

,year,artist,track,time,date.entered,wk1,wk2,wk3,wk4,wk5,...,wk67,wk68,wk69,wk70,wk71,wk72,wk73,wk74,wk75,wk76
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,87,82.0,72.0,77.0,87.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,91,87.0,92.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,81,70.0,68.0,67.0,66.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,3 Doors Down,Loser,4:24,2000-10-21,76,76.0,72.0,69.0,67.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,57,34.0,25.0,17.0,17.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [40]:
bill_long = pd.melt(bill, 
                    id_vars=['year', 'artist', 'track', 'time', 'date.entered'],
                    var_name='week',
                    value_name = 'rating')
bill_long

,year,artist,track,time,date.entered,week,rating
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,wk1,87.0
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,wk1,91.0
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,wk1,81.0
3,2000,3 Doors Down,Loser,4:24,2000-10-21,wk1,76.0
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,wk1,57.0
...,...,...,...,...,...,...,...
24087,2000,Yankee Grey,Another Nine Minutes,3:10,2000-04-29,wk76,NaN
24088,2000,"Yearwood, Trisha",Real Live Woman,3:55,2000-04-01,wk76,NaN
24089,2000,Ying Yang Twins,Whistle While You Tw...,4:19,2000-03-18,wk76,NaN
24090,2000,Zombie Nation,Kernkraft 400,3:30,2000-09-02,wk76,NaN
24091,2000,matchbox twenty,Bent,4:12,2000-04-29,wk76,NaN

In [41]:
bill_long.query('artist == "2 Pac"')

       year artist                    track  time date.entered  week  rating
0      2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26   wk1    87.0
317    2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26   wk2    82.0
634    2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26   wk3    72.0
951    2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26   wk4    77.0
1268   2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26   wk5    87.0
...     ...    ...                      ...   ...          ...   ...     ...
22507  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk72     NaN
22824  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk73     NaN
23141  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk74     NaN
23458  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk75     NaN
23775  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk76     NaN

[76 rows x 7 columns]

In [45]:
ebola_raw = pd.read_csv('country_timeseries.csv')

In [46]:
ebola = ebola_raw.copy()
ebola.shape

(122, 18)

In [47]:
ebola.head()

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,1/5/2015,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,1/4/2015,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,1/3/2015,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,1/2/2015,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,12/31/2014,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN

In [48]:
ebola.iloc[:5, [0,1,2,3,10,11]]

         Date  Day  Cases_Guinea  Cases_Liberia  Deaths_Guinea  Deaths_Liberia
0    1/5/2015  289        2776.0            NaN         1786.0             NaN
1    1/4/2015  288        2775.0            NaN         1781.0             NaN
2    1/3/2015  287        2769.0         8166.0         1767.0          3496.0
3    1/2/2015  286           NaN         8157.0            NaN          3496.0
4  12/31/2014  284        2730.0         8115.0         1739.0          3471.0

In [49]:
ebola_long = pd.melt(ebola, id_vars=['Date', 'Day'])
ebola_long

            Date  Day      variable   value
0       1/5/2015  289  Cases_Guinea  2776.0
1       1/4/2015  288  Cases_Guinea  2775.0
2       1/3/2015  287  Cases_Guinea  2769.0
3       1/2/2015  286  Cases_Guinea     NaN
4     12/31/2014  284  Cases_Guinea  2730.0
...          ...  ...           ...     ...
1947   3/27/2014    5   Deaths_Mali     NaN
1948   3/26/2014    4   Deaths_Mali     NaN
1949   3/25/2014    3   Deaths_Mali     NaN
1950   3/24/2014    2   Deaths_Mali     NaN
1951   3/22/2014    0   Deaths_Mali     NaN

[1952 rows x 4 columns]

In [54]:
var_split = ebola_long['variable'].str.split('_')
var_split

0       [Cases, Guinea]
1       [Cases, Guinea]
2       [Cases, Guinea]
3       [Cases, Guinea]
4       [Cases, Guinea]
             ...
1947     [Deaths, Mali]
1948     [Deaths, Mali]
1949     [Deaths, Mali]
1950     [Deaths, Mali]
1951     [Deaths, Mali]
Name: variable, Length: 1952, dtype: object

In [58]:
var_split[0]

['Cases', 'Guinea']

In [59]:
var_split[0][0]

'Cases'

In [60]:
var_split[0][1]

'Guinea'

In [61]:
var_split_df = ebola_long['variable'].str.split('_', expand=True)
var_split_df.head()

       0       1
0  Cases  Guinea
1  Cases  Guinea
2  Cases  Guinea
3  Cases  Guinea
4  Cases  Guinea

In [63]:
var_split.str.get(0)

0        Cases
1        Cases
2        Cases
3        Cases
4        Cases
         ...
1947    Deaths
1948    Deaths
1949    Deaths
1950    Deaths
1951    Deaths
Name: variable, Length: 1952, dtype: object

In [68]:
var_split.get(1951)

['Deaths', 'Mali']

In [74]:
var_split.str.get(2)

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
        ..
1947   NaN
1948   NaN
1949   NaN
1950   NaN
1951   NaN
Name: variable, Length: 1952, dtype: float64

In [76]:
status_values = var_split.str.get(0)

In [78]:
status_values.unique()

array(['Cases', 'Deaths'], dtype=object)

In [79]:
status_values.nunique()

2

In [80]:
country_values = var_split.str.get(1)

In [81]:
country_values.unique()

array(['Guinea', 'Liberia', 'SierraLeone', 'Nigeria', 'Senegal',
       'UnitedStates', 'Spain', 'Mali'], dtype=object)

In [82]:
country_values.nunique()

8

# 07

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
path = os.getcwd()
path

'C:\\Users\\kiip\\Documents\\github\\doit_pandas'

In [6]:
os.chdir(path + '\\data')
os.getcwd()

'C:\\Users\\kiip\\Documents\\github\\doit_pandas\\data'

In [7]:
pew_raw = pd.read_csv('pew.csv')
pew = pew_raw.copy()
pew.head()

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116

In [8]:
pd.melt(pew, id_vars = 'religion')

                  religion            variable  value
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [9]:
pd.melt(pew, id_vars = 'religion', var_name = 'income', value_name = 'count')

                  religion              income  count
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [10]:
bill_raw = pd.read_csv('billboard.csv')
bill = bill_raw.copy()
bill.head()

,year,artist,track,time,date.entered,wk1,wk2,wk3,wk4,wk5,...,wk67,wk68,wk69,wk70,wk71,wk72,wk73,wk74,wk75,wk76
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,87,82.0,72.0,77.0,87.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,91,87.0,92.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,81,70.0,68.0,67.0,66.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,3 Doors Down,Loser,4:24,2000-10-21,76,76.0,72.0,69.0,67.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,57,34.0,25.0,17.0,17.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
bill_long = pd.melt(bill, id_vars=['year','artist','track','time','date.entered'],
                    var_name='week', value_name='ration')

In [12]:
bill_long

,year,artist,track,time,date.entered,week,ration
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,wk1,87.0
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,wk1,91.0
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,wk1,81.0
3,2000,3 Doors Down,Loser,4:24,2000-10-21,wk1,76.0
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,wk1,57.0
...,...,...,...,...,...,...,...
24087,2000,Yankee Grey,Another Nine Minutes,3:10,2000-04-29,wk76,NaN
24088,2000,"Yearwood, Trisha",Real Live Woman,3:55,2000-04-01,wk76,NaN
24089,2000,Ying Yang Twins,Whistle While You Tw...,4:19,2000-03-18,wk76,NaN
24090,2000,Zombie Nation,Kernkraft 400,3:30,2000-09-02,wk76,NaN
24091,2000,matchbox twenty,Bent,4:12,2000-04-29,wk76,NaN

In [14]:
bill_long.query('artist=="2 Pac"')

       year artist                    track  time date.entered  week  ration
0      2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26   wk1    87.0
317    2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26   wk2    82.0
634    2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26   wk3    72.0
951    2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26   wk4    77.0
1268   2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26   wk5    87.0
...     ...    ...                      ...   ...          ...   ...     ...
22507  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk72     NaN
22824  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk73     NaN
23141  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk74     NaN
23458  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk75     NaN
23775  2000  2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk76     NaN

[76 rows x 7 columns]

In [15]:
ebola_raw = pd.read_csv('country_timeseries.csv')
ebola = ebola_raw.copy()
ebola.head()

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,1/5/2015,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,1/4/2015,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,1/3/2015,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,1/2/2015,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,12/31/2014,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN

In [16]:
ebola_long = pd.melt(ebola, id_vars=['Date','Day'])
ebola_long.head()

         Date  Day      variable   value
0    1/5/2015  289  Cases_Guinea  2776.0
1    1/4/2015  288  Cases_Guinea  2775.0
2    1/3/2015  287  Cases_Guinea  2769.0
3    1/2/2015  286  Cases_Guinea     NaN
4  12/31/2014  284  Cases_Guinea  2730.0

In [17]:
variable_split = ebola_long['variable'].str.split('_')

In [18]:
variable_split

0       [Cases, Guinea]
1       [Cases, Guinea]
2       [Cases, Guinea]
3       [Cases, Guinea]
4       [Cases, Guinea]
             ...
1947     [Deaths, Mali]
1948     [Deaths, Mali]
1949     [Deaths, Mali]
1950     [Deaths, Mali]
1951     [Deaths, Mali]
Name: variable, Length: 1952, dtype: object

In [19]:
variable_split[0]

['Cases', 'Guinea']

In [20]:
variable_split[0][0]

'Cases'

In [22]:
variable_split_df = ebola_long['variable'].str.split('_', expand=True)
variable_split_df.head()

       0       1
0  Cases  Guinea
1  Cases  Guinea
2  Cases  Guinea
3  Cases  Guinea
4  Cases  Guinea

In [34]:
variable_split.get(1)

['Cases', 'Guinea']

In [38]:
variable_split_df.get(0)

0        Cases
1        Cases
2        Cases
3        Cases
4        Cases
         ...
1947    Deaths
1948    Deaths
1949    Deaths
1950    Deaths
1951    Deaths
Name: 0, Length: 1952, dtype: object

In [43]:
variable_split.str.get(0)

0        Cases
1        Cases
2        Cases
3        Cases
4        Cases
         ...
1947    Deaths
1948    Deaths
1949    Deaths
1950    Deaths
1951    Deaths
Name: variable, Length: 1952, dtype: object